{"img": "https://cdn.imgbin.com/21/7/22/imgbin-lg-electronics-lg-corp-logo-lg-pyB29LgQHrGzpAQHJ7aLZKv4X.jpg","about-text":"Headquartered in Seoul, LG is a South Korean electronics manufacturer founded as GoldStar by Koo In-hwoi in 1958. The company was set up to manufacture consumer electronics and home appliances for the local market after the Korean War. Therefore, it was the first to produce radio equipment, televisions, refrigerators, washing machines and air conditioners in South Korea. While the company initially operated under the GoldStar branding, it was later merged with Lucky Chemical and LS Cable –other LG group companies – in 1995.The company’s first overseas production facility was set up in the US in 1982. In 1994 GoldStar officially became LG Electronics. To expand its footprint in the US, LG acquired US-based television manufacturer Zenith and also launched the world’s first CDMA digital mobile phone in 1995. In 1999, the company made a joint venture with Philips, now known as LG Display, to design and develop liquid crystal displays (LCDsLG Electronics made a significant contribution to the world’s consumer electronics and home appliances industry. In 2005, it became one of the top 100 global brands in consumer electronics. As of 2009, its display manufacturing unit, LG Display, had become the world’s largest LCD panel manufacturer. The company started making smartphones in 2010. It was one of the early original equipment manufacturers to adopt Google’s Android as default operating system for its smartphones.In 2014, in partnership with Google, the company also announced the Android Wear-based LG G Watch. The next year, the company launched the LG Watch Urbane, the first LG watch to support smartwatch features such as WiFi.Today, LG Electronics is a global brand that manufactures and sells consumer electronics, mobile communications, and home appliances. Besides, it also makes devices and products for commercial use — G-, V-, and F-series mobile communication products, in-vehicle infotainment, HVAC and motor, and vehicle engineering components. In addition, the company also makes commercial display solutions, solar solutions, energy storage systems, energy management solutions, membranes, stylers and lighting products, besides compressors and motors."}
